//===========================================================================//
/*****************************************************************************/
//---------------------------------------------------------------------------//
/** \file 
*  File Name  : para_define.h
*  Author     : CMS Appliction Team
*  Version    : 第二代风机软件平台
*  Date       : 20232023年2月02
** Description: 本页参数为硬件相关参数。
** 
//---------------------------------------------------------------------------//
******************************************************************************/
//===========================================================================//

#ifndef  __PARA_DEFINE_H__
#define  __PARA_DEFINE_H__

#include "user_control.h"

//---------------------------------------------------------------------------//
/****************************<< 上电延时时间 >>*******************************/
#define  POWERON_DELAY_TIME                 (10)

//===========================================================================//
/****************************<< 系统功能配置 >>*******************************/
//===========================================================================//

//---------------------------------------------------------------------------//
/****************************<< 电阻采样方式 >>*******************************/
#define  Single_Shunt                       (0)                      // 单电阻
#define  Double_Shunt                       (1)                      // 双电阻
#define  Config_Shunt_Mode                  (Single_Shunt)

//---------------------------------------------------------------------------//
/****************************<< SVPWM调制方式 >>******************************/
#define  Segment_7                          (0)                      // 七段式
#define  Segment_5                          (1)                      // 五段式
#define  Config_SVPWM_Mode                  (Segment_7)

//---------------------------------------------------------------------------//
/****************************<< 顺风检测功能 >>*******************************/  
#define  Start_NoWind                       (0)                      // 顺风检测功能关闭
#define  Start_Wind                         (1)                      // 顺风检测功能开启
#define  Config_Wind_Mode                   (Start_Wind)

//---------------------------------------------------------------------------//
/****************************<< Bandgap反校功能使能 >>************************/
// 未使用
#define  BANDGAP_DISABLE                    (0)                      // 关闭Bandgap反校功能
#define  BANDGAP_ENABLE                     (1)                      // 开启Bandgap反校功能
#define  CONFIG_BANDGAP_MODE                (BANDGAP_DISABLE)

//---------------------------------------------------------------------------//
/****************************<< 外环控制方式选择 >>***************************/
#define  Current_Loop                       (0)                      // 电流环                      
#define  Speed_Loop                         (1)                      // 速度环                     
#define  Power_Loop                         (2)                      // 功率环                      
#define  Config_Contorl_Mode                (Power_Loop)

//---------------------------------------------------------------------------//
/****************************<< 弱磁功能 >>***********************************/
#define  Weaken_Disable                     (0)                      // 弱磁功能关闭            
#define  Weaken_Enable                      (1)                      // 弱磁功能开启          
#define  Config_Weak_Mode                   (Weaken_Enable)
#define  WEAKENING_RANGE                    (0.95)                   // 弱磁程度 (%)

//---------------------------------------------------------------------------//
/****************************<< 预充电功能 >>*********************************/ 
// 充电使能--PN驱动无需开启，NN驱动可开启
#define  CHARGE_DISABLE                     (0)                      // 预充电关闭
#define  CHARGE_ENABLE                      (1)                      // 预充电使能
#define  CHARGE_MODE                        (CHARGE_DISABLE)							
#define  CHARGE_TIME                        (10)                     // 预充电时间 单位：ms


//---------------------------------------------------------------------------//
/****************************<< GA通道选择 >>*********************************/
// 一般用于电机相电流检测（双电阻） 或 母线电流检测（单电阻/恒功率）
#define  PGA_CH0                            (0)
#define  PGA_CH12                           (1)
#define  PGA_CH012                          (2)
#define  PGA_NONE                           (3)
#define  PGA_CH                             (PGA_CH0)

//---------------------------------------------------------------------------//
/****************************<< 比较器通道选择 >>*****************************/
// 用于EPWM故障刹车保护
#define  ACMP_CH0                           (0)
#define  ACMP_CH1                           (1)
#define  ACMP_NONE                          (2)
#define  ACMP_CH                            (ACMP_CH1)

//---------------------------------------------------------------------------//
/****************************<< 电流采样相序匹配 >>***************************/
// 双电阻方案：PGA1与PGA2 对应的采样通道，包含六种情况
// 单电阻方案无需配置，默认即可
#define  IP_UV                              (0)
#define  IP_UW                              (1)
#define  IP_VU                              (2)
#define  IP_VW                              (3)
#define  IP_WU                              (4)
#define  IP_WV                              (5)
#define  IP_SAMP_CH                         (IP_UV)


//===========================================================================//
/****************************<< ADC通道映射配置 >>****************************/
//===========================================================================//

//---------------------------------------------------------------------------//
/****************************<< 单电阻/双电阻采样双通道配置 >>****************/ 
// 其中双电阻方案默认PGA1/2，单电阻方案默认PGA0
#if (Config_Shunt_Mode == Single_Shunt)

#define  ADC_DATA_CHA                       (ADC_CH_0)
#define  ADC_SCAN_CHA                       (ADC_CH_0_MSK)

#define  ADC_DATA_CHB                       (ADC_CH_1)
#define  ADC_SCAN_CHB                       (ADC_CH_1_MSK)

#elif (Config_Shunt_Mode == Double_Shunt)

#define  ADC_DATA_CHA                       (ADC_CH_2)			
#define  ADC_SCAN_CHA                       (ADC_CH_2_MSK)	

#define  ADC_DATA_CHB                       (ADC_CH_3)
#define  ADC_SCAN_CHB                       (ADC_CH_3_MSK)

#endif

//---------------------------------------------------------------------------//
/****************************<< 模拟信号采样通道配置 >>***********************/
// 模拟信号采样通道配置，按照硬件修改配置

//---------------------------------------------------------------------------//
/****************************<< 反电动势信号采样通道配置 >>*******************/
#define  ADC_DATA_UBEMF                     (ADC_CH_6)
#define  ADC_SCAN_UBEMF                     (ADC_CH_6_MSK)           // MCU_BEMF_U

#define  ADC_DATA_VBEMF                     (ADC_CH_4)
#define  ADC_SCAN_VBEMF                     (ADC_CH_4_MSK)           // MCU_BEMF_V

#define  ADC_DATA_WBEMF                     (ADC_CH_5)
#define  ADC_SCAN_WBEMF                     (ADC_CH_5_MSK)           // MCU_BEMF_W
//---------------------------------------------------------------------------//
/****************************<< 母线电流信号采样通道配置 >>*******************/
#define  ADC_DATA_IBUS                      (ADC_CH_10)
#define  ADC_SCAN_IBUS                      (ADC_CH_10_MSK)          // 母线电流采样
//---------------------------------------------------------------------------//
/****************************<< 母线电压信号采样通道配置 >>*******************/
#define  ADC_DATA_VBUS                      (ADC_CH_18)
#define  ADC_SCAN_VBUS                      (ADC_CH_18_MSK)           // 母线电压采样(P16采样)
//---------------------------------------------------------------------------//
/****************************<< VSP调速信号采样通道配置 >>********************/
#define  ADC_DATA_CTRL                      (ADC_CH_13)
#define  ADC_SCAN_CTRL                      (ADC_CH_13_MSK)          // 调速信号采样
//---------------------------------------------------------------------------//
/****************************<< NTC温度信号采样通道配置 >>********************/
#define  ADC_DATA_TEMP                      (ADC_CH_17)
#define  ADC_SCAN_TEMP                      (ADC_CH_17_MSK)          // NTC温度信号采样
//---------------------------------------------------------------------------//
/****************************<< Bandgap信号采样通道配置 >>********************/
// 未使用
#define  ADC_DATA_BG                        (ADC_CH_23)
#define  ADC_SCAN_BG                        (ADC_CH_23_MSK)          // Bandgap 采样


//===========================================================================//
/****************************<< 系统参数配置 >>*******************************/
//===========================================================================//

//---------------------------------------------------------------------------//
/****************************<< EPWM相关参数设置 >>***************************/
#define  MCU_CLK                            (64000000ul)             // MCU CLK
#define  EPWM_FREQ                          (25000)                  // EPWM FREQ
#define  EPWM_PERIOD                        (MCU_CLK/EPWM_FREQ/2)
#define  EPWM_HALFPERIOD                    (EPWM_PERIOD/2)
#define  EPWM_Tus                           (64.0)                   // 64: 1us
#define  EPWM_CPMTG                         (0.5)                    // 双电阻方案：采样提前时间 单位：us

//---------------------------------------------------------------------------//
/****************************<< 单电阻窗口采样时间设置 >>*********************/
#define  EPWM_DT                            (1.5)                    // 死区时间；1.2us
#define  SAMPLE_STEADY                      (0.5)                    // 信号（震荡）稳定时间，0.5us
#define  SAMPLE_TGDLY                       (EPWM_DT+SAMPLE_STEADY)  // 单电阻方案：采样延迟时间 单位：us

//---------------------------------------------------------------------------//
/****************************<< 电机基值参数设置 >>***************************/                                                                                         
#define  MOTOR_SPEED_BASE                   (150000UL)               // 转速基值 (RPM)
#define  MOTOR_POWER_BASE                   (400)                    // 功率基值 (W)                            
#define  MOTOR_VOLT_BASE                    ((float)HW_VBUS_VOLT/1.732)           
#define  MOTOR_IBUS_BASE                    ((float)MOTOR_POWER_BASE/HW_VBUS_VOLT)

//---------------------------------------------------------------------------//
/****************************<< 电机状态切换参数设置 >>***********************/ 
#define  MOTOR_SPEED_CLOSE                  (10000)                  // 马达启动开环切闭环转速 单位：RPM 
#define  MOTOR_SPEED_STOP                   (10000)                  // 马达停机判段转速 （封6管MOS） 单位：RPM 
#define  SPEED_OFFSET                       (0)                      // 转速偏差校正 单位：RPM 
#define  MOTOR_SPEED_CLOSE_TIME             (40)                     // 马达启动成功开环切闭环时间 单位：ms 
#define  TIME_START_HOLD                    (20)                     // 启动完成保持时间  单位：ms (100~5000ms)
#define  TIME_STOP_HOLD                     (1000)                   // 停机延时时间单位：ms


//===========================================================================//
/****************************<< FOC控制参数配置 >>****************************/
//===========================================================================//

//---------------------------------------------------------------------------//
/****************************<< D轴启动PI参数设置 >>**************************/
#define  START_DKP                          _Q15(0.5)                // D轴PI参数：Kp
#define  START_DKI                          _Q15(0.01)              // D轴PI参数：Ki
#define  START_DOUT_MAX                     _Q15(0.3)                // D轴PI参数：最大输出
#define  START_DOUT_MIN                     _Q15(-0.5)               // D轴PI参数：最小输出

//---------------------------------------------------------------------------//
/****************************<< Q轴启动PI参数设置 >>**************************/
#define  START_QKP                          _Q15(0.3)                // Q轴PI参数：Kp
#define  START_QKI                          _Q15(0.01)               // Q轴PI参数：Ki
#define  START_QOUT_MAX                     _Q15(0.5)                // Q轴PI参数：最大输出
#define  START_QOUT_MIN                     _Q15(-0.3)               // Q轴PI参数：最小输出

//---------------------------------------------------------------------------//
/****************************<< D轴运行PI参数设置 >>**************************/
#define  FOC_DKP                            _Q15(1.0)                // D轴PI参数：Kp
#define  FOC_DKI                            _Q15(0.02)               // D轴PI参数：Ki
#define  FOC_DOUT_MAX                       _Q15(0.8)                // D轴PI参数：最大输出
#define  FOC_DOUT_MIN                       _Q15(-0.9)               // D轴PI参数：最小输出

//---------------------------------------------------------------------------//
/****************************<< Q轴运行PI参数设置 >>**************************/
#define  FOC_QKP                            _Q15(1.0)                // Q轴PI参数：Kp
#define  FOC_QKI                            _Q15(0.02)               // Q轴PI参数：Ki
#define  FOC_QOUT_MAX                       _Q15(0.95)               // Q轴PI参数：最大输出
#define  FOC_QOUT_MIN                       _Q15(-0.8)               // Q轴PI参数：最小输出

//---------------------------------------------------------------------------//
/****************************<< 运行估算器参数设置 >>*************************/
#define  FOC_EKP                            _Q15(0.3)                // 运行估算器PI参数：Kp
#define  FOC_EKI                            _Q15(0.003)              // 运行估算器PI参数：Ki
#define  FOC_FC_LPF                         (100)                    // 估算器截至频率 单位：Hz

//---------------------------------------------------------------------------//
/****************************<< FOC控制周期参数设置 >>************************/ 
#define  FOC_ERAMP                          (1)                      // 角度估算周期 单位：Tpwm
#define  FOC_FRAMP                          (3)                      // 弱磁控制周期 单位：Tpwm

//---------------------------------------------------------------------------//
/****************************<< 外环运行参数设置 >>***************************/ 
#define  FOC_WOUT_MAX                       (FOC_RUN_CURRENT_MAX)    // 外环输出最小值
#define  FOC_WOUT_MIN                       (FOC_RUN_CURRENT_MIN)    // 外环输出最大值

//---------------------------------------------------------------------------//
/****************************<< 滑膜参数参数设置 >>***************************/ 
#define  SMO_KSLIDE                         _Q15(0.5)                // SMO参数：0.5~1.0
#define  SMO_KE                             _Q15(0.5)                // SMO参数：0.01~0.5 
#define  SMO_EBW_FCL                        (1.0)                    // 反电动势低通滤波器截止频率下限
#define  SMO_EBW_FCH                        (10)                     // 反电动势低通滤波器截止频率上限

#endif  /* __PARA_DEFINE_H__ */
